<script>
export default {
  name: 'Help',
  data () {
    return {
      question: [
        {
          value: '账户使用与安全',
          vList: [
            {
              title: '1.新用户如何注册？',
              content: ['用户可登录APP首页使用手机号码进行账号注册及登录密码设置。']
            }, {
              title: '2.平台支持哪几种支付方式？',
              content: ['目前支持微信支付和支付宝支付两种支付方式。']
            }, {
              title: '3.忘记了登录密码该如何找回？',
              content: ['用户可在登录界面点击“忘记密码”，通过注册的手机号码获取验证码来重置密码。']
            }, {
              title: '4.如何查看及使用优惠券？',
              content: ['如何查看优惠券：用户可进入个人中心-我的优惠券进行查看。优惠券有一定的使用时间，请及时使用。，如何使用优惠券：在用户下单支付时，可看到优惠券选项。用户可选择可使用的优惠券进行抵扣。']
            }, {
              title: '5.能开取发票吗？',
              content: ['平台目前暂不提供发票。']
            }, {
              title: '6.如何查看购买及充值记录？',
              content: ['用户可在个人中心查看充值相关订单及商场订单。']
            }
          ]
        }, {
          value: '油卡充值相关',
          vList: [
            {
              title: '1.支持那些类型的油卡充值？',
              content: [
                '支持：直营中石化、中石油加油站办理的个人记名主卡充值；暂不支持：副卡、不记名卡、增值税票卡、过期卡、中石油BP卡、司机卡充值。'
              ]
            }, {
              title: '2.用户该如何绑定加油卡？同一账户可以绑定多张油卡吗？',
              content: [
                '用户需在个人中心进行油卡添加，并输入油卡类型、油卡卡号和姓名进行绑定；同一账户可绑定多张油卡。'
              ]
            }, {
              title: '3.油卡直充一般多久到账？',
              content: [
                '油卡直充金额将在订单支付成功后的48小时内到账。'
              ]
            }, {
              title: '4.为什么油卡需要圈存之后才能使用？',
              content: [
                '圈存（激活）指将用户账户中的金额划存至加油卡上。充值金额到账后，用户需持加油卡到加油站联系工作人员进行圈存，圈存成功后即可正常刷卡加油。'
              ]
            }, {
              title: '5.油卡充值支付成功后是否支持无条件退款？',
              content: [
                '油卡充值暂不支持无条件退款。'
              ]
            }, {
              title: '6.加油充值能否多次购买？有次数限制吗？',
              content: [
                '本平台的加油充值目前没有次数限制，可以叠加购买。'
              ]
            }, {
              title: '7.加油套餐充值是多久到账的？',
              content: [
                '若用户购买的是加油套餐，第一笔充值金额将在48小时内到账，其他充值金额将在每月的购买日期冲至油卡内。如4月1日选择充值3个月的加油套餐，第一笔金额到账时间为4月1日，第二笔金额到账时间为5月1日，第三笔金额到账时间为6月1日。'
              ]
            }, {
              title: '8.付款成功后，订单为何一直处于未付款状态？',
              content: [
                '因系统或网络原因可能导致订单信息未能及时更新，用户可耐心等待片刻再查看订单状态，如若长时间仍未更新，请致电客服热线：400-061-8558。'
              ]
            }, {
              title: '9.若油卡遗失或损坏了，怎么办？',
              content: [
                '（1）若油卡遗失或损坏，用户需要去直营加油站重新办理加油卡，新旧油卡的姓名必须一致；',
                '（2）用户在APP上重新添加新办理的加油卡，并且联系客服人员将遗失或损坏的旧油卡上的套餐转移至新油卡，油卡遗失挂失后请及时补办；',
                '（3）遗失或损坏的油卡里剩余的资金需要用户通过中石油、中石化的工作人员进行资金转移操作，转移至用户的新油卡内。'
              ]
            }
          ]
        }, {
          value: '话费充值相关',
          vList: [
            {
              title: '1.哪些号码可以进行话费充值？',
              content: ['中国联通、中国移动、中国电信的号码。']
            }, {
              title: '2.充错号码能取消订单进行退款吗？',
              content: ['如果话费充值订单提交成功，号码已经提交运营商进行充值处理，是无法修改和取消的，所以不支持退款。因此充值时请用户仔细核对需要充值的手机号码，以避免充错。']
            }, {
              title: '3.话费充值成功后一般多久到账？',
              content: ['话费直充：话费直充将在10分钟内到账。',
                '话费套餐：若购买的是3个月及以上话费套餐，第一笔金额将在10分钟内充值到账，之后每个月的话费将在当月的充值时间到账。'
              ]
            }, {
              title: '4.为何话费充值购买时一直无法正常支付？',
              content: ['月末、月初是话费充值高峰期，因系统繁忙可能会导致个别订单购买失败，请用户耐心等待进行刷新重试。'
              ]
            }
          ]
        }, {
          value: '商城及售后退换服务',
          vList: [
            {
              title: '1.商品下单成功后，多久能发货？',
              content: ['一般商品下单发货时效为72小时内（特殊商品除外）。']
            }, {
              title: '2.如何查询商品物流情况？',
              content: ['用户可在商城订单中找到已发货订单进行物流信息查看。']
            }, {
              title: '3.下错单如何取消？',
              content: ['若用户下错单并未支付成功，可进入商城订单中查询到未付款订单进行取消。']
            }, {
              title: '4.商城是否支持7天无理由退换货？',
              content: ['用户可在商品详情页查看该商品是否支持7天无理由退换货。']
            }, {
              title: '5.物流一直处于未更新状态怎么办？',
              content: ['部分快递可能由于快递公司未能及时更新快递信息，导致查询不到物流信息，建议用户耐心等1-2天后再查询。如仍未查询到物流信息，请致电相应的快递公司进行咨询。']
            }, {
              title: '6.下单后能否更换收货地址？',
              content: ['用户可到商城订单中查看订单发货状态：\n' +
              '订单未发货：用户可与客服进行联系修改收货地址，客服热线：400-061-8558；\n' +
              '订单已发货：不支持修改收货地址。']
            }, {
              title: '7.退、换货处理该如何操作？',
              content: ['因受到商品存在质量问题需进行退换货处理，用户可以拨打客服热线400-061-8558进行反馈。']
            }, {
              title: '8.发现商品错寄、漏寄怎么办？',
              content: ['若用户一旦发现收到的商品存在错寄、漏寄等问题，请及时与客服取得联系，以便进行补发或换货处理。客服热线：400-061-8558。']
            }, {
              title: '9.退、换货、补寄的邮费由谁来承担？',
              content: ['因平台质量、缺货等原因：邮费一般由平台承担；\n' +
              '非平台、非商品质量问题等原因：邮费一般由用户承担。']
            }, {
              title: '10.用户可以指定快递配送吗？     ',
              content: ['目前不接受指定快递公司配送。']
            }
          ]
        }
      ]
    }
  },
  render () {
    return <div>
      <img src={ require('@/assets/img/help.png') } width="100%" />
      <div class="wrap help">
        <Tabs type="card">
          { this.question.map((item, index) => {
            return <TabPane key={ index } label={ item.value } >
              { item.vList.map((it, ind) => {
                return <div class="help-item">
                  <p class="help-title">{it.title}</p>
                  <p class="help-content">{it.content}</p>
                </div>
              })}
            </TabPane>
          })}
        </Tabs>
      </div>
    </div>
  }
}
</script>

<style lang="less">
  .help {
    margin: 40px auto;
    background-color: #f7fafc;
    .help-item {
      padding: 40px 60px;
      letter-spacing: 1px;
      .help-title {
        font-size: 16px;
        font-weight: 700;
        color: #262F63;
        padding: 10px;
      }
      .help-content {
        font-size: 16px;
        color: #333333;
        padding: 10px;
        line-height: 28px;
      }
    }
    .ivu-tabs-nav-scroll {
      background-color: #fff;
      border-bottom: 1px solid #f1f3f5;
    }
    .ivu-tabs-tab {
      color: #999 !important;
      font-size: 16px;
      background-color: #fff !important;
      border: 0 none !important;
    }
    .ivu-tabs-tab-active {
      color: #fff !important;
      background:#262F63 !important;
    }
  }
</style>
